Enterprise_Serivces/Prod/Bronze1/Brierley/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/brierleyservice/contracts/2010/11/IBrierleyService/GetRewardProductCatalog</wsa:Action><wsa:MessageID>uuid:e5e1107f-2f88-47c8-a67e-d0f54396f890</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://brierley.gamestop.com/BrierleyService.svc</wsa:To></soap:Header><soap:Body><GetRewardProductCatalog xmlns="http://www.gamestop.com/services/channel/brierleyservice/contracts/2010/11"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName></request></GetRewardProductCatalog></soap:Body></soap:Envelope>